docs/coquitlam.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-20 Sun 15:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Coquitlam</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="warren" />
<link rel="stylesheet"
                    href="../files/style.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">Coquitlam</h1>
<p>
Lets plan how to get Coquitlam (and the whole Tri-Cities) to Zero
Emissions.
</p>

<p>
I need a better name for this&#x2026;
</p>
<ul class="org-ul">
<li>Dignity</li>
<li>Excursion</li>
<li>Imagination</li>
<li>Reverie</li>
<li>Concept</li>
<li>Contemplation</li>
<li>Epiphany</li>
<li>Insight</li>
<li>Utopia</li>
<li>Luster, Sparkle, Shine,</li>
<li>Revenant</li>
<li>Return</li>
<li>Rise/Legacy</li>
<li>Accord</li>
<li>Harmony</li>
</ul>

<p>
(It might be easier to frame this as coming back to what was, rather than bolding seeking what is new).
</p>

<p>
Also, what's the region to target?
</p>
<ul class="org-ul">
<li>Tri Cities I think&#x2026; as Erik said, it's surrounded by natural features.</li>
</ul>


<p>
Our history is a mill&#x2026; before WW2 (and before Lougheed highway) it would have been more inward focused.
</p>

<div id="outline-container-org843e077" class="outline-2">
<h2 id="org843e077">Test Index</h2>
<div class="outline-text-2" id="text-org843e077">
<p>
This is a test index entry&#x2026;
</p>
</div>
</div>

<div id="outline-container-org14cd232" class="outline-2">
<h2 id="org14cd232">History</h2>
<div class="outline-text-2" id="text-org14cd232">
<p>
Coquitlam
By 1908, a mill town of 20 houses, a store, post office, hospital, office block, barber shop, pool hall and a Sikh temple[6] had grown around the mill. 
</p>

<p>
Port Coquitlam
Was originally farming.
A major impetus to the creation of a municipality was when the Canadian Pacific Railway moved its freight terminus from Vancouver to "Westminster Junction", building a spur line to the Fraser River port of New Westminster in 1911.
</p>

<p>
Port Moody
Was originally a military fort.
</p>

<p>
Had a train line and boom followed by Bust as the train went to
Vancouver. 
</p>

<p>
The railway was completed with the last spike driven at Craigellachie
on November 7, 1885 and a train arriving at Port Moody the next
day. The first scheduled passenger transcontinental train arrived on
July 4, 1886, a date which is still celebrated during Golden Spike
Days. Real estate prices soared, but soon fell flat when a branch line
was built to Vancouver in 1887.
</p>

<p>
While many people lost a great deal of money and moved on, others,
including real estate tycoon and ship captain, James A. Clarke, and
several lumber mills, decided to remain. On April 7, 1913, Port
Moody's Council met for the first time as a city.
</p>
</div>
</div>


<div id="outline-container-org9e28aba" class="outline-2">
<h2 id="org9e28aba">Is there anything in History to use?</h2>
<div class="outline-text-2" id="text-org9e28aba">
<p>
I'd like to present it as a return&#x2026; one could say that we're
historically mills&#x2026; but then eclipsed by Vancouver.
</p>

<p>
We'd be returning to the frontier spirit&#x2026; blazing a new trail.
</p>

<p>
Tri-Cities Frontier Proposal
</p>

<p>
As rugged individuals against a harsh nature, we're recovering the
pride of our ancestry and history and building an integrated
Tri-Cities that is Green.
</p>

<p>
Need some narratives here&#x2026; about people and the changes they are
making&#x2026;
</p>
</div>
</div>

<div id="outline-container-org7d2a80a" class="outline-2">
<h2 id="org7d2a80a">Radio Station: 98.7 The Point</h2>
<div class="outline-text-2" id="text-org7d2a80a">
<p>
98.7 radio station &#x2013; the Point.
</p>
</div>
</div>

<div id="outline-container-org9c7ad7f" class="outline-2">
<h2 id="org9c7ad7f">What Goes into this Plan?</h2>
<div class="outline-text-2" id="text-org9c7ad7f">
<p>
A vision for the next many years.
</p>

<ul class="org-ul">
<li>Integrating the City to reduce driving</li>
<li>A transit plan</li>
<li>Energy efficiency measures</li>
<li>Zoning changes to encourage densification</li>
<li>Green Spaces and stuff like that</li>
<li>Ammenities, social housing, etc,</li>
<li>Resilency via local committee efforts.</li>
<li>ELECTRIFIED CITY FLEET (They spend 3,870,000 per year on fleet capital).</li>
</ul>

<p>
More ideas:
</p>

<ul class="org-ul">
<li>Tech incubator for green tech (e.g. mist showers)</li>
<li>Living wage regulation &#x2013; so Coq businesses must pay at least enough so that there
workers can afford the live in Coq?</li>
<li>Buyback of abandoned homes. Convert to neighborhood green spaces.
(About $12 million a year is spent buying parklands&#x2026; so that's like twelve houses ;-)
But why should some private individual make a million dollars on an abandoned home?</li>
<li>Covered side walks (e.g. by trees) wider sidewalks.
(Bicycle/Greenway Facilities Program in Coquitlam?)</li>
<li>Zoning changes.</li>
<li>Promoting eat local, buy local?</li>
<li>Raise money via 'Bonds' &#x2013; city debt owned to city citizens and repayed to them,
rather than to banks.</li>
<li>Why are libraries public but gyms private?  Why are roads public
but telecommunications private?  Why are buses public but taxis
private?</li>
</ul>

<p>
Civic facilities are expensive&#x2026; are they necessary? Is there a small
sort of thing that could be done?  Like turning houses into libraries?
Or library depots or something?
</p>
</div>
</div>

<div id="outline-container-org434cc58" class="outline-2">
<h2 id="org434cc58">Where will the money come from?</h2>
<div class="outline-text-2" id="text-org434cc58">
<p>
I've started looking at the budget&#x2026;
</p>

<p>
A few things:
</p>
<ul class="org-ul">
<li>Do we have a problem with extractive rents? (e.g. companies that work here, but funnel
profits far out of the community? &#x2013; like people buying from Amazon)</li>
<li>Can we make 'lateral' transfers?  Higher taxes that support services that lower cost of living
by an eqivalent amount?</li>
<li>Are we charging a fair amount for taxes?  Are some groups getting an superb deal?</li>

<li>If any groups are not expected to pay property taxes, are they providing some other social
benefit?</li>

<li>Why does it cost so much to develop a park?  What are we talking about here?  Can we do
cheaper parks &#x2013; just let nature grow?   How about these sports facilities &#x2013; important,
do we have enough or too many?  Should they be centralized like this, or more dispersed?</li>

<li>We shouldn't be afraid of having common property that eliminates some private businesses.
E.g. libraries, public gyms.  Having these things can make good sense (case by case). Lower cost of
living, and more integrated communities.  Is there a good rubric for deciding what things are
best public and what things are best private?   E.g. why are libraries public but gyms are not?
Why are roads public but telecommunications private?  Why are buses public but taxis private?</li>
</ul>
</div>
</div>


<div id="outline-container-org20cb0ce" class="outline-2">
<h2 id="org20cb0ce">Publishing</h2>
<div class="outline-text-2" id="text-org20cb0ce">
</div><div id="outline-container-orgbd6876b" class="outline-3">
<h3 id="orgbd6876b">Website</h3>
<div class="outline-text-3" id="text-orgbd6876b">
<p>
I think I'll just publish my DEFT collection as a project. Then it'll
be up to date most of the time. Put a GIT repo on it and others can
access it if they want too.
</p>
</div>
</div>

<div id="outline-container-orgf3ab54d" class="outline-3">
<h3 id="orgf3ab54d">Reports</h3>
<div class="outline-text-3" id="text-orgf3ab54d">
<p>
Reports are harder. I like latex, but others probably don't so much.  Still,
for what we're trying to do it might be valuable.
</p>
</div>
</div>

<div id="outline-container-org2d820e8" class="outline-3">
<h3 id="org2d820e8">Presentations</h3>
<div class="outline-text-3" id="text-org2d820e8">
<p>
Harder still. Latex presentations are not wonderful and not interactive&#x2026; might
want to look at one of those website based presentation tools.
</p>

<p>
reveal.js looks great.
impress.js and hovercraft look great&#x2026;
</p>

<p>
How do newspapers do those interactive things?  It's called 'storytelling'.
Google javascript storytelling library.
</p>

<p>
<a href="https://geoviz.ceoas.oregonstate.edu/storymap/">https://geoviz.ceoas.oregonstate.edu/storymap/</a>
</p>

<p>
<a href="https://pudding.cool/process/how-to-implement-scrollytelling/demo/waypoints/">https://pudding.cool/process/how-to-implement-scrollytelling/demo/waypoints/</a>
</p>

<p>
<a href="https://pudding.cool/process/how-to-implement-scrollytelling/">https://pudding.cool/process/how-to-implement-scrollytelling/</a>
</p>

<p>
This one recommends a 'stepper'.
<a href="https://eagereyes.org/blog/2016/the-scrollytelling-scourge">https://eagereyes.org/blog/2016/the-scrollytelling-scourge</a>
</p>
</div>
</div>

<div id="outline-container-org9c463d2" class="outline-3">
<h3 id="org9c463d2">Videos</h3>
<div class="outline-text-3" id="text-org9c463d2">
<p>
To be determined.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: warren</p>
<p class="date">Created: 2019-10-20 Sun 15:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
